Revit 2026 API

# CategoryNameMapIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CategoryNameMapIterator()
```
```vb
Public Sub New
```
```cpp
public:
CategoryNameMapIterator()
```
```fsharp
new : unit -> CategoryNameMapIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

CategoryNameMapIterator Class

Autodesk.Revit.DB Namespace